{
  "1password-secret-key": "Revoke the exposed key via the 1Password admin panel and rotate credentials. Audit vault access logs.",
  "1password-service-account-token": "Revoke the exposed 1Password service account token immediately. Review audit logs and rotate credentials.",
  "adafruit-api-key": "Regenerate the Adafruit API key via your account dashboard and restrict it to required services only.",
  "adobe-client-id": "Revoke the exposed Adobe OAuth client ID. Consider rotating associated secrets and reviewing application access.",
  "adobe-client-secret": "Immediately revoke the Adobe client secret and generate a new one. Review applications using this credential.",
  "age-secret-key": "Never expose private encryption keys. Revoke the key, if possible, and regenerate securely.",
  "airtable-api-key": "Rotate your Airtable API key and consider using OAuth with proper scopes instead of static keys.",
  "algolia-api-key": "Restrict the exposed Algolia key to read-only access and regenerate if write access was allowed.",
  "alibaba-access-key-id": "Revoke the Alibaba AccessKey and rotate both ID and secret. Review RAM policies for over-privileged access.",
  "alibaba-secret-key": "Revoke the Alibaba secret key and issue a new one. Enforce use of least-privilege RAM roles.",
  "asana-client-id": "Rotate the Asana Client ID and review app integrations for any potential misuse.",
  "asana-client-secret": "Revoke the Asana Client Secret via the developer console and issue a new one securely.",
  "atlassian-api-token": "Rotate the Atlassian API token and review audit logs for unauthorized access attempts.",
  "aws-access-token": "Revoke the AWS access token and issue a new one. Review IAM policies for over-privileged access.",
  "codecov-access-token": "Revoke the exposed Codecov token immediately via the Codecov dashboard. Store tokens securely using environment variables or secret managers. Avoid committing them to version control.",
  "cohere-api-token": "Revoke and rotate the Cohere API token via the developer dashboard. Store it in environment variables or a secret manager. Avoid hardcoding the key in source code or configuration files.",
  "coinbase-access-token": "Immediately revoke and regenerate the Coinbase access token. Never expose it in code repositories. Store credentials securely in a secrets manager and audit all usage.",
  "confluent-access-token": "Revoke and rotate the Confluent Access Token using the Confluent management interface. Always use environment variables or secret management tools to store such tokens securely.",
  "confluent-secret-key": "Invalidate the exposed Confluent secret key and issue a new one. Ensure secrets are not committed to version control and are managed securely via a secret manager.",
  "contentful-delivery-api-token": "Revoke and rotate the Contentful delivery API token from the Contentful dashboard. Avoid exposing this token in source code. Use environment variables or secrets storage systems instead.",
  "curl-auth-header": "Never include sensitive tokens in curl command headers within scripts or documentation. Use secure credential storage and avoid sharing tokens in plaintext or public sources.",
  "curl-auth-user": "Avoid including usernames and passwords directly in curl commands. Instead, use environment variables or secure token-based authentication methods to protect credentials.",
  "databricks-api-token": "Revoke and rotate the exposed Databricks API token immediately. Store tokens securely using environment variables or secret managers. Avoid committing tokens to source code repositories.",
  "datadog-access-token": "Revoke and regenerate the Datadog Access Token. Use secure storage such as environment variables or secret management tools. Do not expose tokens in code or logs.",
  "defined-networking-api-token": "Immediately invalidate the Defined Networking API token and issue a new one. Store secrets securely and avoid committing them to version control.",
  "digitalocean-access-token": "Revoke and rotate the DigitalOcean OAuth Access Token. Use environment variables or secret management systems for secure storage.",
  "digitalocean-pat": "Revoke and replace the DigitalOcean Personal Access Token. Never hardcode tokens; store them securely and restrict their permissions.",
  "digitalocean-refresh-token": "Revoke and regenerate the DigitalOcean OAuth Refresh Token. Secure tokens in secret managers and avoid exposure in code or logs.",
  "discord-api-token": "Revoke and rotate the Discord API key immediately. Store API keys in environment variables or secrets managers, and avoid embedding them in source code.",
  "discord-client-id": "Keep the Discord client ID private. Do not expose it unnecessarily; use environment variables and restrict usage to trusted applications.",
  "discord-client-secret": "Revoke and replace the Discord client secret. Store it securely and never commit it to source control or share publicly.",
  "doppler-api-token": "Revoke the exposed Doppler API token and rotate credentials. Use secure storage solutions and avoid embedding tokens in code.",
  "droneci-access-token": "Revoke and regenerate the Droneci Access Token. Use environment variables or secret managers to store credentials securely.",
  "dropbox-api-token": "Revoke and rotate the Dropbox API token to prevent unauthorized file access. Store secrets securely and avoid exposing tokens in code.",
  "dropbox-long-lived-api-token": "Revoke and regenerate Dropbox long-lived API tokens immediately. Use secret management tools and never commit tokens to repositories.",
  "dropbox-short-lived-api-token": "Even short-lived tokens should be revoked if exposed. Rotate tokens regularly and use secure storage.",
  "duffel-api-token": "Revoke and replace the Duffel API token. Store tokens securely with limited access and avoid committing to codebases.",
  "dynatrace-api-token": "Revoke the Dynatrace API token immediately. Use secure storage and avoid sharing tokens in logs or source code.",
  "easypost-api-token": "Rotate and revoke EasyPost API tokens on exposure. Store tokens securely and restrict their scope and usage.",
  "easypost-test-api-token": "Rotate and revoke test tokens to prevent misuse of test environments. Use secure storage and avoid embedding them in code.",
  "etsy-access-token": "Revoke and replace Etsy Access Tokens if exposed. Use environment variables or secret managers and avoid hardcoding tokens.",
  "facebook-access-token": "Rotate the token immediately and review all Facebook app permissions. Avoid hardcoding tokens in code and use environment variables or secure vaults.",
  "facebook-page-access-token": "Rotate the page access token immediately and audit page admin roles. Store tokens securely, never expose in public repos.",
  "facebook-secret": "Regenerate the Facebook app secret to invalidate exposed keys. Keep secrets in secure vaults and restrict access.",
  "fastly-api-token": "Rotate the Fastly API key and audit CDN configurations. Use least privilege access and store keys securely.",
  "finicity-api-token": "Rotate the Finicity API token and review connected financial integrations. Avoid embedding tokens in source code.",
  "finicity-client-secret": "Regenerate the client secret to prevent unauthorized API access. Use encrypted storage and limit exposure.",
  "finnhub-access-token": "Rotate the Finnhub token and monitor API usage. Store securely and avoid hardcoding.",
  "flickr-access-token": "Invalidate the Flickr token and generate a new one. Restrict token scope and keep tokens out of public repos.",
  "flutterwave-encryption-key": "Rotate encryption keys and audit payment integrations. Use hardware security modules or key management services.",
  "flutterwave-public-key": "Regularly rotate public keys and ensure proper key distribution management.",
  "flutterwave-secret-key": "Rotate secret keys frequently and audit financial transaction logs. Protect keys with strong encryption.",
  "flyio-access-token": "Rotate Fly.io API tokens and review application deployment permissions. Store tokens securely.",
  "frameio-api-token": "Rotate Frame.io API tokens to prevent unauthorized access. Limit token scopes and use environment variables.",
  "freemius-secret-key": "Regenerate secret keys and audit plugin access. Store secrets securely and avoid exposing in PHP files.",
  "freshbooks-access-token": "Rotate Freshbooks tokens immediately and audit accounting software permissions. Use secure token management practices.",
  "gcp-api-key": "Rotate GCP API keys regularly and enable API key restrictions (IP, referrer). Use IAM roles and store keys in secrets managers.",
  "generic-api-key": "Immediately identify the service linked to the exposed key, revoke or rotate it, audit usage logs for unauthorized activity, and ensure keys are stored securely and not hardcoded.",
  "github-app-token": "Revoke the compromised GitHub App token from the GitHub developer settings, rotate credentials, and review app permissions and integrations for suspicious activity.",
  "github-fine-grained-pat": "Revoke the exposed fine-grained personal access token, audit repository access logs, rotate tokens regularly, and avoid committing tokens in code repositories.",
  "github-oauth": "Revoke the GitHub OAuth access token, audit connected applications and sessions, rotate secrets, and implement token scanning in CI/CD pipelines.",
  "github-pat": "Immediately revoke the personal access token, audit repository and organization access, rotate all related secrets, and implement automated secret scanning.",
  "github-refresh-token": "Revoke the refresh token to prevent prolonged unauthorized access, rotate related access tokens, and audit token usage.",
  "gitlab-cicd-job-token": "Revoke the CI/CD job token, rotate credentials, audit CI/CD pipeline permissions, and implement environment-specific token restrictions.",
  "gitlab-deploy-token": "Rotate the deploy token immediately, audit repository and package access, restrict token permissions, and store deploy tokens securely.",
  "gitlab-feature-flag-client-token": "Revoke the exposed feature flag client token, audit application feature flag usage, and rotate tokens periodically.",
  "gitlab-feed-token": "Rotate the feed token, audit data access logs, restrict token scope where possible, and store tokens securely.",
  "gitlab-incoming-mail-token": "Revoke the incoming mail token, audit mail handling and processing, and rotate related credentials to prevent mail manipulation.",
  "gitlab-kubernetes-agent-token": "Rotate the Kubernetes agent token immediately, audit connected repositories and registries, and ensure tokens have minimal required scopes.",
  "gitlab-oauth-app-secret": "Regenerate the OAuth app secret, audit application authentication flows, and securely store new secrets in a vault or environment variables.",
  "gitlab-pat": "Revoke the exposed GitLab personal access token, audit repository access and activity, rotate all relevant credentials, and enable token expiration policies.",
  "gitlab-pat-routable": "Immediately revoke the exposed GitLab Personal Access Token (PAT), audit repository and group access logs for unauthorized activity, rotate all related secrets, enforce strict token expiration policies, and implement automated token scanning in CI/CD pipelines.",
  "gitlab-ptt": "Revoke the GitLab Pipeline Trigger Token, audit pipeline run logs for suspicious activities, rotate tokens regularly, and restrict trigger token permissions and scope to minimal required access.",
  "gitlab-rrt": "Immediately revoke the GitLab Runner Registration Token, audit runner registration and usage logs, rotate registration tokens regularly, and restrict token usage to authorized runners only.",
  "gitlab-runner-authentication-token": "Revoke the GitLab Runner Authentication Token, audit CI/CD runner activity for unauthorized access, rotate tokens, and enforce strong authentication and network restrictions for runners.",
  "gitlab-runner-authentication-token-routable": "Revoke the routable GitLab Runner Authentication Token immediately, audit pipeline and runner access, rotate tokens, and enforce environment-specific token usage policies to prevent leakage.",
  "gitlab-scim-token": "Revoke the GitLab SCIM Token to prevent unauthorized user and group provisioning, audit SCIM integration logs, rotate tokens regularly, and restrict token permissions to necessary scopes.",
  "gitlab-session-cookie": "Invalidate active GitLab sessions associated with the compromised session cookie, force re-authentication for affected users, audit user login activities, and implement secure cookie attributes (HttpOnly, Secure, SameSite).",
  "gitter-access-token": "Immediately revoke the exposed Gitter Access Token to prevent unauthorized chat and communication service access. Audit chat logs for suspicious activity and implement automated secret scanning to detect future leaks.",
  "gocardless-api-token": "Revoke the compromised GoCardless API token immediately to stop unauthorized direct debit operations. Review payment logs for fraudulent transactions, rotate all related credentials, and enforce strict token usage policies.",
  "grafana-api-key": "Invalidate the exposed Grafana API key to block unauthorized access to monitoring dashboards. Audit Grafana access logs for anomalies, rotate all API keys, and enable token expiration policies.",
  "grafana-cloud-api-token": "Revoke the compromised Grafana Cloud API token to protect cloud monitoring data. Review cloud service logs, rotate tokens, and enforce minimal required scopes for API tokens.",
  "grafana-service-account-token": "Immediately revoke the Grafana service account token to secure monitoring services and data integrity. Audit service account activities and rotate all related tokens regularly.",
  "harness-api-key": "Revoke the Harness Access Token (PAT or SAT) promptly to prevent unauthorized account access. Review account activity logs, rotate tokens, and implement least privilege principles for token scopes.",
  "hashicorp-tf-api-token": "Immediately revoke the exposed HashiCorp Terraform API token to avoid unauthorized infrastructure changes. Audit infrastructure provisioning logs, rotate credentials, and restrict token scope and lifetime.",
  "hashicorp-tf-password": "Change the exposed HashiCorp Terraform password immediately to prevent unauthorized access. Audit infrastructure configuration changes and enforce strong password policies.",
  "heroku-api-key": "Revoke the exposed Heroku API key to secure cloud application deployments. Audit deployment logs for unauthorized activity, rotate keys, and enable multi-factor authentication.",
  "hubspot-api-key": "Immediately revoke the HubSpot API token to protect CRM data and prevent unauthorized marketing actions. Audit CRM access logs, rotate tokens, and enforce strict token permission scopes.",
  "huggingface-access-token": "Immediately revoke the exposed Hugging Face Access Token to prevent unauthorized access to AI models and sensitive data. Audit usage logs and implement automated secret scanning to detect future leaks.",
  "huggingface-organization-api-token": "Revoke the compromised Hugging Face Organization API Token promptly to secure organizational accounts and data. Review API activity for suspicious actions and rotate all related credentials.",
  "infracost-api-token": "Invalidate the exposed Infracost API Token immediately to prevent unauthorized access to cloud cost estimation and financial data. Audit cost reports and rotate tokens regularly.",
  "intercom-api-key": "Revoke the detected Intercom API Token to protect customer communication channels and sensitive information. Check logs for unauthorized usage and enforce strict token scopes.",
  "intra42-client-secret": "Change the exposed Intra42 client secret immediately to prevent unauthorized API access to 42School services. Audit API calls and rotate secrets regularly.",
  "jfrog-api-key": "Immediately revoke the discovered JFrog API Key to prevent unauthorized access to software repositories and build pipelines. Review artifact logs and rotate keys.",
  "jfrog-identity-token": "Revoke the compromised JFrog Identity Token to secure access to JFrog services and sensitive software artifacts. Audit token usage and rotate tokens frequently.",
  "jwt": "Investigate the uncovered JSON Web Token for potential misuse. If compromised, revoke associated session or tokens, rotate secrets, and audit user activity.",
  "jwt-base64": "Analyze the detected Base64-encoded JWT for unauthorized access risks. Revoke or rotate affected credentials and audit all relevant authentication events.",
  "kraken-access-token": "Immediately revoke the exposed Kraken Access Token to secure cryptocurrency trading accounts. Review account activity for unauthorized transactions and enable multi-factor authentication.",
  "kubernetes-secret-yaml": "Immediately audit and rotate any Kubernetes Secrets detected to prevent unauthorized access to deployment credentials or tokens. Implement strict RBAC policies and enable automated secret scanning in CI/CD pipelines.",
  "kucoin-access-token": "Revoke the exposed Kucoin Access Token immediately to block unauthorized access to your cryptocurrency exchange account. Review transaction logs for suspicious activity and enable multi-factor authentication.",
  "kucoin-secret-key": "Immediately invalidate the Kucoin Secret Key to prevent compromised cryptocurrency trading operations. Rotate the key and audit all related API activity for any signs of misuse.",
  "launchdarkly-access-token": "Revoke the exposed Launchdarkly Access Token promptly to secure your feature flag management. Review all feature flag changes and enforce token rotation policies regularly.",
  "linear-api-key": "Immediately revoke and regenerate the detected Linear API Token to protect sensitive project management data and integrations. Audit all API access and implement secure storage for tokens.",
  "linear-client-secret": "Change the exposed Linear Client Secret immediately to prevent unauthorized access to integrations. Audit all recent client activities and enforce secret rotation policies.",
  "linkedin-client-id": "Review the usage of the exposed LinkedIn Client ID to ensure no unauthorized access to LinkedIn integrations. Rotate the client ID if possible and audit related application access logs.",
  "linkedin-client-secret": "Revoke the exposed LinkedIn Client Secret immediately to prevent unauthorized access to your LinkedIn application integrations. Audit recent application activity and rotate secrets regularly.",
  "lob-api-key": "Immediately revoke and regenerate the exposed Lob API Key to secure mailing and address verification services. Monitor for suspicious activity and implement strict key management policies.",
  "lob-pub-api-key": "Review and rotate the detected Lob Publishable API Key to reduce risk of unauthorized use in mail and print service integrations. Limit exposure of publishable keys in public repositories.",
  "mailchimp-api-key": "Revoke the discovered Mailchimp API key promptly to protect email marketing campaigns and subscriber data. Audit API usage and enforce token rotation and secure storage.",
  "mailgun-private-api-token": "Immediately invalidate the exposed Mailgun private API token to prevent unauthorized email service operations. Review email logs for suspicious activity and rotate tokens frequently.",
  "mailgun-pub-key": "Rotate the detected Mailgun public validation key to maintain security of email verification processes. Avoid exposing public keys unnecessarily.",
  "mailgun-signing-key": "Revoke and regenerate the Mailgun webhook signing key to safeguard email automation and ensure data integrity. Audit webhook usage and implement secure key management.",
  "mapbox-api-token": "Rotate the detected MapBox API token promptly to protect geospatial services and sensitive location data. Monitor API usage and restrict token permissions to minimum necessary.",
  "mattermost-access-token": "Revoke the exposed Mattermost Access Token immediately to prevent unauthorized access to team communication channels and protect sensitive data. Audit recent activity and rotate tokens regularly.",
  "maxmind-license-key": "Treat the discovered MaxMind license key as sensitive; rotate or replace it if exposed to avoid misuse of geolocation services and data inaccuracies.",
  "messagebird-api-token": "Revoke the detected MessageBird API token promptly to prevent unauthorized use of messaging services. Monitor usage and rotate keys frequently.",
  "messagebird-client-id": "Protect your MessageBird client ID by limiting its exposure and rotate credentials regularly to secure API integrations.",
  "microsoft-teams-webhook": "Regenerate Microsoft Teams Webhooks found in public code to prevent unauthorized posting and data leakage. Review webhook permissions and audit recent webhook activity.",
  "netlify-access-token": "Revoke the detected Netlify Access Token immediately to avoid unauthorized control over your web hosting and site configurations. Enforce strict token management policies.",
  "new-relic-browser-api-token": "Rotate the discovered New Relic browser API token to safeguard application performance monitoring data from unauthorized access.",
  "new-relic-insert-key": "Invalidate and regenerate New Relic insert keys found exposed to protect data injection processes and maintain data integrity.",
  "new-relic-user-api-id": "Limit exposure of New Relic user API IDs and rotate them if compromised to secure application monitoring services.",
  "new-relic-user-api-key": "Revoke or rotate the exposed New Relic user API Key immediately to prevent unauthorized access to application insights and performance data. Audit recent usage for suspicious activity.",
  "npm-access-token": "Invalidate the detected npm access token promptly to avoid unauthorized package publishing or repository access. Enforce token rotation and limit token scopes.",
  "nuget-config-password": "Change passwords found in Nuget config files to prevent unauthorized package management access. Avoid storing plaintext passwords in config files.",
  "nytimes-access-token": "Rotate or revoke the detected New York Times access token to prevent unauthorized access to APIs and content services. Monitor API usage for anomalies.",
  "octopus-deploy-api-key": "Revoke any exposed Octopus Deploy API keys to prevent unauthorized deployment actions. Implement strict key management and audit deployment logs.",
  "okta-access-token": "Revoke the exposed Okta access token immediately to protect identity management and user authentication data. Monitor for unauthorized logins and rotate tokens regularly.",
  "openai-api-key": "Regenerate OpenAI API keys found exposed to prevent unauthorized usage of AI services. Restrict key permissions and monitor usage patterns.",
  "openshift-user-token": "Invalidate the exposed OpenShift user token to protect Kubernetes cluster access. Review cluster logs for unauthorized activity and enforce strict token policies.",
  "perplexity-api-key": "Rotate the exposed Perplexity API key to prevent unauthorized access to AI services and data leakage. Audit API usage and restrict key permissions.",
  "pkcs12-file": "Immediately secure any private keys contained in the discovered PKCS #12 files. Avoid storing PKCS #12 files in unsecured or public repositories. Use strong passwords and encryption for PKCS #12 bundles.",
  "plaid-api-token": "Revoke or rotate the exposed Plaid API token to prevent unauthorized access to financial data and services. Monitor API usage for suspicious activities and limit token permissions.",
  "plaid-client-id": "Review and rotate the exposed Plaid Client ID if possible. Ensure that client IDs are not exposed in public repositories or logs to avoid unauthorized integrations.",
  "plaid-secret-key": "Rotate the Plaid secret key immediately to prevent unauthorized access to financial accounts and transaction data. Restrict secret key usage and monitor API calls.",
  "planetscale-api-token": "Revoke or regenerate the exposed PlanetScale API token to protect database management operations. Enforce strict token management and audit database access.",
  "planetscale-oauth-token": "Invalidate the exposed PlanetScale OAuth token to secure database access control. Review access logs for suspicious activity and enforce token rotation policies.",
  "planetscale-password": "Change any discovered PlanetScale passwords promptly to avoid unauthorized database access. Avoid storing passwords in plaintext and implement strong password policies.",
  "postman-api-token": "Rotate the exposed Postman API token to protect API testing workflows. Limit token scopes and audit usage for potential abuse.",
  "prefect-api-token": "Revoke or rotate the Prefect API token to secure workflow automation services. Monitor for unauthorized access and restrict token permissions.",
  "private-key": "Immediately secure and rotate any private keys found. Ensure private keys are stored securely, not exposed in repositories, and protected by strong encryption and access controls.",
  "privateai-api-token": "Revoke or rotate the exposed PrivateAI token immediately to prevent unauthorized access to AI services and potential data manipulation. Monitor usage and restrict token permissions as needed.",
  "pulumi-api-token": "Rotate the discovered Pulumi API token to secure infrastructure as code operations and cloud resource management. Limit token permissions and audit access logs.",
  "pypi-upload-token": "Revoke the exposed PyPI upload token to prevent unauthorized Python package uploads and maintain repository integrity. Use scoped tokens and monitor package publishing activities.",
  "rapidapi-access-token": "Rotate or revoke the exposed RapidAPI access token to avoid unauthorized use of APIs and protect sensitive data. Review API usage and restrict permissions.",
  "readme-api-token": "Immediately revoke or rotate the Readme API token to secure documentation management and prevent unauthorized content changes. Monitor token usage.",
  "rubygems-api-token": "Rotate the Rubygems API token to prevent unauthorized Ruby package distribution. Audit token usage and restrict permissions.",
  "scalingo-api-token": "Revoke or rotate the Scalingo API token to secure cloud platform services and application deployment. Monitor for unusual activity.",
  "sendbird-access-id": "Secure and rotate the Sendbird Access ID to prevent unauthorized integration with chat and messaging services. Audit usage and restrict access.",
  "sendbird-access-token": "Immediately rotate the Sendbird Access Token to avoid unauthorized access to communication services and user data. Monitor token activity closely.",
  "sendgrid-api-token": "Revoke or rotate the SendGrid API token to protect email service operations and prevent data exposure. Limit token permissions and monitor usage.",
  "sendinblue-api-token": "Rotate or revoke the Sendinblue API token to protect email marketing services and subscriber data. Monitor token use and enforce strict access policies.",
  "sentry-access-token": "Revoke or rotate the exposed Sentry.io Access Token immediately to prevent unauthorized access to error tracking services and sensitive application data. Monitor token usage and limit permissions.",
  "sentry-org-token": "Immediately revoke or rotate the Sentry.io Organization Token to avoid unauthorized access to organizational error tracking data. Audit usage and restrict access rights.",
  "sentry-user-token": "Rotate the Sentry.io User Token promptly to prevent unauthorized use of error tracking services and exposure of sensitive data. Monitor token activity closely.",
  "settlemint-application-access-token": "Revoke or rotate the Settlemint Application Access Token to secure access to application services and prevent unauthorized operations. Limit token scope and monitor usage.",
  "settlemint-personal-access-token": "Rotate the Settlemint Personal Access Token to avoid unauthorized personal access. Enforce strict permissions and audit token usage regularly.",
  "settlemint-service-access-token": "Immediately rotate or revoke the Settlemint Service Access Token to protect service-level integrations from unauthorized access. Monitor and restrict token permissions.",
  "shippo-api-token": "Revoke or rotate the Shippo API token to prevent unauthorized access to shipping services and protect customer order data. Audit token usage and limit permissions.",
  "shopify-access-token": "Rotate the Shopify access token promptly to avoid unauthorized access to the e-commerce platform and protect sensitive store data. Monitor usage and restrict token permissions.",
  "shopify-custom-access-token": "Revoke or rotate the Shopify custom access token to secure custom app integrations and prevent data breaches. Limit scope and audit access.",
  "shopify-private-app-access-token": "Immediately rotate the Shopify private app access token to prevent unauthorized access to private app data and store operations. Monitor token activity closely.",
  "shopify-shared-secret": "Rotate or revoke the Shopify shared secret to secure application authentication and prevent unauthorized platform access. Audit usage and enforce strict controls.",
  "sidekiq-secret": "Revoke or rotate the exposed Sidekiq Secret immediately to prevent compromised background job processing and protect application data. Audit job queue access and restrict permissions.",
  "sidekiq-sensitive-url": "Invalidate or rotate credentials embedded in the exposed Sidekiq Sensitive URL to prevent unauthorized access to internal job queues and sensitive operational data. Monitor and secure access points.",
  "slack-app-token": "Rotate the detected Slack App-level token promptly to avoid unauthorized access to Slack applications and workspace data. Monitor token usage and limit scopes.",
  "slack-bot-token": "Revoke or rotate the Slack Bot token to secure bot integrations and communication channels from unauthorized use. Audit bot activity and restrict permissions.",
  "slack-config-access-token": "Immediately rotate the Slack Configuration access token to protect workspace configurations and prevent unauthorized access to sensitive settings. Monitor token use.",
  "slack-config-refresh-token": "Rotate the Slack Configuration refresh token to prevent prolonged unauthorized access to configuration settings. Enforce strict token management and monitoring.",
  "slack-legacy-bot-token": "Revoke or rotate the Slack Legacy bot token to prevent compromised legacy bot operations and protect data integrity. Audit legacy bot usage carefully.",
  "slack-legacy-token": "Rotate detected Slack Legacy tokens to avoid unauthorized access to older integrations and user data. Monitor legacy token usage and restrict as needed.",
  "slack-legacy-workspace-token": "Immediately revoke or rotate Slack Legacy Workspace tokens to secure workspace data and legacy features from unauthorized access. Enforce token lifecycle policies.",
  "slack-user-token": "Revoke or rotate Slack User tokens promptly to prevent unauthorized user impersonation and unauthorized data access within Slack workspaces. Monitor user token activity closely.",
  "slack-webhook-url": "Revoke or rotate the discovered Slack Webhook URL immediately to prevent unauthorized message posting and potential data leakage in Slack channels. Audit incoming requests and restrict webhook usage.",
  "snyk-api-token": "Rotate the exposed Snyk API token promptly to prevent compromise of software vulnerability scanning and code security. Review API token permissions and monitor usage.",
  "sonar-api-token": "Revoke or rotate the detected Sonar API token to secure software vulnerability scanning processes and protect code security. Monitor token activity and limit access scope.",
  "sourcegraph-access-token": "Rotate the Sourcegraph access token immediately to avoid unauthorized code search and navigation access. Audit token use and enforce least privilege.",
  "square-access-token": "Revoke or rotate the detected Square Access Token to prevent unauthorized payment processing and financial transaction exposure. Monitor payment activities and secure tokens.",
  "squarespace-access-token": "Rotate the Squarespace Access Token to protect website management and content control from unauthorized access. Monitor token usage and restrict permissions as needed.",
  "stripe-access-token": "Immediately rotate the Stripe Access Token to secure payment processing services and sensitive financial data. Audit transactions and enforce token best practices.",
  "sumologic-access-id": "Rotate the discovered SumoLogic Access ID to prevent unauthorized access to log management services and maintain data analytics integrity. Monitor access logs.",
  "sumologic-access-token": "Revoke or rotate the SumoLogic Access Token to block unauthorized access to log data and analytics insights. Enforce strict token management and monitoring.",
  "telegram-bot-api-token": "Revoke or rotate the discovered Telegram Bot API Token immediately to prevent unauthorized bot operations and message interception on Telegram. Audit bot activity and restrict token usage.",
  "travisci-access-token": "Rotate the exposed Travis CI Access Token promptly to prevent compromise of continuous integration services and protect codebase security. Review token permissions and monitor usage.",
  "twilio-api-key": "Revoke or rotate the detected Twilio API Key to secure communication services and protect sensitive customer interaction data. Monitor API usage and enforce strict access controls.",
  "twitch-api-token": "Immediately rotate the discovered Twitch API token to prevent unauthorized access to streaming services and account integrations. Audit token activity and restrict permissions.",
  "twitter-access-secret": "Rotate the uncovered Twitter Access Secret promptly to prevent unauthorized Twitter integrations and protect against data breaches. Monitor secret usage and enforce security best practices.",
  "twitter-access-token": "Revoke or rotate the detected Twitter Access Token to avoid unauthorized account operations and exposure of social media data. Monitor token activity and audit related actions.",
  "twitter-api-key": "Immediately rotate the identified Twitter API Key to protect Twitter application integrations and user data security. Limit API key scope and monitor usage closely.",
  "twitter-api-secret": "Revoke or rotate the found Twitter API Secret to secure Twitter app integrations and prevent sensitive data access. Audit secret usage and enforce strict controls.",
  "twitter-bearer-token": "Rotate the discovered Twitter Bearer Token immediately to prevent unauthorized API access and data retrieval from Twitter. Monitor token activity and restrict permissions.",
  "typeform-api-token": "Revoke or rotate the uncovered Typeform API token immediately to prevent unauthorized survey management and data collection. Audit API usage and restrict token permissions.",
  "vault-batch-token": "Revoke or rotate the detected Vault Batch Token promptly to prevent unauthorized access to secret management services and sensitive data. Review token scope and monitor activity.",
  "vault-service-token": "Rotate the identified Vault Service Token to protect infrastructure security and prevent unauthorized access to sensitive credentials. Enforce strict access controls and audit usage.",
  "yandex-access-token": "Revoke or rotate the found Yandex Access Token to secure Yandex service integrations and protect user data privacy. Monitor token usage and enforce permission least-privilege.",
  "yandex-api-key": "Immediately rotate the discovered Yandex API Key to prevent unauthorized access to Yandex services and data manipulation. Limit key scope and audit usage regularly.",
  "yandex-aws-access-token": "Revoke or rotate the uncovered Yandex AWS Access Token promptly to protect cloud resource access and ensure data security on Yandex Cloud. Monitor access logs closely.",
  "zendesk-secret-key": "Rotate the detected Zendesk Secret Key immediately to prevent unauthorized access to customer support services and protect sensitive ticketing data. Audit key usage and restrict permissions."
}